---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsSurfaceToleranceSet
source: html/f8daf04e-a6c1-f5a4-82cd-1b6d3fb104ee.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsSurfaceToleranceSet Method

Checks whether the SurfaceTolerance tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsSurfaceToleranceSet()
```

## Returns
True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.